SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_advertiser_past_transfer(uint8_t connection,
                                           uint16_t service_data,
                                           uint8_t advertising_set) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_advertiser_past_transfer.connection=connection;
    cmd->data.cmd_advertiser_past_transfer.service_data=service_data;
    cmd->data.cmd_advertiser_past_transfer.advertising_set=advertising_set;

    cmd->header=sl_bt_cmd_advertiser_past_transfer_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_advertiser_past_transfer.result;

}

sl_status_t sl_bt_sync_past_transfer(uint8_t connection,
                                     uint16_t service_data,
                                     uint16_t sync) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_sync_past_transfer.connection=connection;
    cmd->data.cmd_sync_past_transfer.service_data=service_data;
    cmd->data.cmd_sync_past_transfer.sync=sync;

    cmd->header=sl_bt_cmd_sync_past_transfer_id+(((5)&0xff)<<8)+(((5)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_sync_past_transfer.result;

}

sl_status_t sl_bt_pawr_sync_set_sync_subevents(uint16_t sync,
                                               size_t subevents_len,
                                               const uint8_t* subevents) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_pawr_sync_set_sync_subevents.sync=sync;
    if ((3+subevents_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_pawr_sync_set_sync_subevents.subevents.len=subevents_len;
    memcpy(cmd->data.cmd_pawr_sync_set_sync_subevents.subevents.data,subevents,subevents_len);

    cmd->header=sl_bt_cmd_pawr_sync_set_sync_subevents_id+(((3+subevents_len)&0xff)<<8)+(((3+subevents_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_pawr_sync_set_sync_subevents.result;

}

sl_status_t sl_bt_pawr_sync_set_response_data(uint16_t sync,
                                              uint16_t request_event,
                                              uint8_t request_subevent,
                                              uint8_t response_subevent,
                                              uint8_t response_slot,
                                              size_t response_data_len,
                                              const uint8_t* response_data) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_pawr_sync_set_response_data.sync=sync;
    cmd->data.cmd_pawr_sync_set_response_data.request_event=request_event;
    cmd->data.cmd_pawr_sync_set_response_data.request_subevent=request_subevent;
    cmd->data.cmd_pawr_sync_set_response_data.response_subevent=response_subevent;
    cmd->data.cmd_pawr_sync_set_response_data.response_slot=response_slot;
    if ((8+response_data_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_pawr_sync_set_response_data.response_data.len=response_data_len;
    memcpy(cmd->data.cmd_pawr_sync_set_response_data.response_data.data,response_data,response_data_len);

    cmd->header=sl_bt_cmd_pawr_sync_set_response_data_id+(((8+response_data_len)&0xff)<<8)+(((8+response_data_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_pawr_sync_set_response_data.result;

}

sl_status_t sl_bt_pawr_advertiser_start(uint8_t advertising_set,
                                        uint16_t interval_min,
                                        uint16_t interval_max,
                                        uint32_t flags,
                                        uint8_t num_subevents,
                                        uint8_t subevent_interval,
                                        uint8_t response_slot_delay,
                                        uint8_t response_slot_spacing,
                                        uint8_t response_slots) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_pawr_advertiser_start.advertising_set=advertising_set;
    cmd->data.cmd_pawr_advertiser_start.interval_min=interval_min;
    cmd->data.cmd_pawr_advertiser_start.interval_max=interval_max;
    cmd->data.cmd_pawr_advertiser_start.flags=flags;
    cmd->data.cmd_pawr_advertiser_start.num_subevents=num_subevents;
    cmd->data.cmd_pawr_advertiser_start.subevent_interval=subevent_interval;
    cmd->data.cmd_pawr_advertiser_start.response_slot_delay=response_slot_delay;
    cmd->data.cmd_pawr_advertiser_start.response_slot_spacing=response_slot_spacing;
    cmd->data.cmd_pawr_advertiser_start.response_slots=response_slots;

    cmd->header=sl_bt_cmd_pawr_advertiser_start_id+(((14)&0xff)<<8)+(((14)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_pawr_advertiser_start.result;

}

sl_status_t sl_bt_pawr_advertiser_set_subevent_data(uint8_t advertising_set,
                                                    uint8_t subevent,
                                                    uint8_t response_slot_start,
                                                    uint8_t response_slot_count,
                                                    size_t adv_data_len,
                                                    const uint8_t* adv_data) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_pawr_advertiser_set_subevent_data.advertising_set=advertising_set;
    cmd->data.cmd_pawr_advertiser_set_subevent_data.subevent=subevent;
    cmd->data.cmd_pawr_advertiser_set_subevent_data.response_slot_start=response_slot_start;
    cmd->data.cmd_pawr_advertiser_set_subevent_data.response_slot_count=response_slot_count;
    if ((5+adv_data_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_pawr_advertiser_set_subevent_data.adv_data.len=adv_data_len;
    memcpy(cmd->data.cmd_pawr_advertiser_set_subevent_data.adv_data.data,adv_data,adv_data_len);

    cmd->header=sl_bt_cmd_pawr_advertiser_set_subevent_data_id+(((5+adv_data_len)&0xff)<<8)+(((5+adv_data_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_pawr_advertiser_set_subevent_data.result;

