SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_connection_get_tx_power(uint8_t connection,
                                          uint8_t phy,
                                          int8_t *current_level,
                                          int8_t *max_level) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_get_tx_power.connection=connection;
    cmd->data.cmd_connection_get_tx_power.phy=phy;

    cmd->header=sl_bt_cmd_connection_get_tx_power_id+(((2)&0xff)<<8)+(((2)&0x700)>>8);


    sl_bt_host_handle_command();
    if (current_level) {
        *current_level = rsp->data.rsp_connection_get_tx_power.current_level;
    }
    if (max_level) {
        *max_level = rsp->data.rsp_connection_get_tx_power.max_level;
    }
    return rsp->data.rsp_connection_get_tx_power.result;

}

sl_status_t sl_bt_connection_get_remote_tx_power(uint8_t connection,
                                                 uint8_t phy) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_get_remote_tx_power.connection=connection;
    cmd->data.cmd_connection_get_remote_tx_power.phy=phy;

    cmd->header=sl_bt_cmd_connection_get_remote_tx_power_id+(((2)&0xff)<<8)+(((2)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_connection_get_remote_tx_power.result;

}

sl_status_t sl_bt_connection_set_tx_power(uint8_t connection,
                                          int16_t tx_power,
                                          int16_t *tx_power_out) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_set_tx_power.connection=connection;
    cmd->data.cmd_connection_set_tx_power.tx_power=tx_power;

    cmd->header=sl_bt_cmd_connection_set_tx_power_id+(((3)&0xff)<<8)+(((3)&0x700)>>8);


    sl_bt_host_handle_command();
    if (tx_power_out) {
        *tx_power_out = rsp->data.rsp_connection_set_tx_power.tx_power_out;
    }
    return rsp->data.rsp_connection_set_tx_power.result;

}

sl_status_t sl_bt_connection_read_remote_used_features(uint8_t connection) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_read_remote_used_features.connection=connection;

    cmd->header=sl_bt_cmd_connection_read_remote_used_features_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_connection_read_remote_used_features.result;

}

sl_status_t sl_bt_connection_get_security_status(uint8_t connection,
                                                 uint8_t *security_mode,
                                                 uint8_t *key_size,
                                                 uint8_t *bonding_handle) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_get_security_status.connection=connection;

    cmd->header=sl_bt_cmd_connection_get_security_status_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    if (security_mode) {
        *security_mode = rsp->data.rsp_connection_get_security_status.security_mode;
    }
    if (key_size) {
        *key_size = rsp->data.rsp_connection_get_security_status.key_size;
    }
    if (bonding_handle) {
        *bonding_handle = rsp->data.rsp_connection_get_security_status.bonding_handle;
    }
    return rsp->data.rsp_connection_get_security_status.result;

}

sl_status_t sl_bt_connection_set_data_length(uint8_t connection,
                                             uint16_t tx_data_len,
                                             uint16_t tx_time_us) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_set_data_length.connection=connection;
    cmd->data.cmd_connection_set_data_length.tx_data_len=tx_data_len;
    cmd->data.cmd_connection_set_data_length.tx_time_us=tx_time_us;

    cmd->header=sl_bt_cmd_connection_set_data_length_id+(((5)&0xff)<<8)+(((5)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_connection_set_data_length.result;

}

sl_status_t sl_bt_connection_read_statistics(uint8_t connection, uint8_t reset) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_read_statistics.connection=connection;
    cmd->data.cmd_connection_read_statistics.reset=reset;

    cmd->header=sl_bt_cmd_connection_read_statistics_id+(((2)&0xff)<<8)+(((2)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_connection_read_statistics.result;

}

sl_status_t sl_bt_connection_get_scheduling_details(uint8_t connection,
                                                    uint32_t *access_address,
                                                    uint8_t *role,
                                                    uint32_t *crc_init,
                                                    uint16_t *interval,
                                                    uint16_t *supervision_timeout,
                                                    uint8_t *central_clock_accuracy,
                                                    uint8_t *central_phy,
                                                    uint8_t *peripheral_phy,
                                                    uint8_t *channel_selection_algorithm,
                                                    uint8_t *hop,
                                                    sl_bt_connection_channel_map_t *channel_map,
                                                    uint8_t *channel,
                                                    uint16_t *event_counter,
                                                    uint32_t *start_time_us) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_get_scheduling_details.connection=connection;

    cmd->header=sl_bt_cmd_connection_get_scheduling_details_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    if (access_address) {
        *access_address = rsp->data.rsp_connection_get_scheduling_details.access_address;
    }
    if (role) {
        *role = rsp->data.rsp_connection_get_scheduling_details.role;
    }
    if (crc_init) {
        *crc_init = rsp->data.rsp_connection_get_scheduling_details.crc_init;
    }
    if (interval) {
        *interval = rsp->data.rsp_connection_get_scheduling_details.interval;
    }
    if (supervision_timeout) {
        *supervision_timeout = rsp->data.rsp_connection_get_scheduling_details.supervision_timeout;
    }
    if (central_clock_accuracy) {
        *central_clock_accuracy = rsp->data.rsp_connection_get_scheduling_details.central_clock_accuracy;
    }
    if (central_phy) {
        *central_phy = rsp->data.rsp_connection_get_scheduling_details.central_phy;
    }
    if (peripheral_phy) {
        *peripheral_phy = rsp->data.rsp_connection_get_scheduling_details.peripheral_phy;
    }
    if (channel_selection_algorithm) {
        *channel_selection_algorithm = rsp->data.rsp_connection_get_scheduling_details.channel_selection_algorithm;
    }
    if (hop) {
        *hop = rsp->data.rsp_connection_get_scheduling_details.hop;
    }
    if (channel_map) {
        memcpy(channel_map,&rsp->data.rsp_connection_get_scheduling_details.channel_map,sizeof(sl_bt_connection_channel_map_t));
    }
    if (channel) {
        *channel = rsp->data.rsp_connection_get_scheduling_details.channel;
    }
    if (event_counter) {
        *event_counter = rsp->data.rsp_connection_get_scheduling_details.event_counter;
    }
    if (start_time_us) {
        *start_time_us = rsp->data.rsp_connection_get_scheduling_details.start_time_us;
    }
    return rsp->data.rsp_connection_get_scheduling_details.result;

