SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
    cmd->header=sl_bt_cmd_gattdb_remove_service_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_remove_service.result;

}

sl_status_t sl_bt_gattdb_add_included_service(uint16_t session,
                                              uint16_t service,
                                              uint16_t included_service,
                                              uint16_t *attribute) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_add_included_service.session=session;
    cmd->data.cmd_gattdb_add_included_service.service=service;
    cmd->data.cmd_gattdb_add_included_service.included_service=included_service;

    cmd->header=sl_bt_cmd_gattdb_add_included_service_id+(((6)&0xff)<<8)+(((6)&0x700)>>8);


    sl_bt_host_handle_command();
    if (attribute) {
        *attribute = rsp->data.rsp_gattdb_add_included_service.attribute;
    }
    return rsp->data.rsp_gattdb_add_included_service.result;

}

sl_status_t sl_bt_gattdb_remove_included_service(uint16_t session,
                                                 uint16_t attribute) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_remove_included_service.session=session;
    cmd->data.cmd_gattdb_remove_included_service.attribute=attribute;

    cmd->header=sl_bt_cmd_gattdb_remove_included_service_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_remove_included_service.result;

}

sl_status_t sl_bt_gattdb_add_uuid16_characteristic(uint16_t session,
                                                   uint16_t service,
                                                   uint16_t property,
                                                   uint16_t security,
                                                   uint8_t flag,
                                                   sl_bt_uuid_16_t uuid,
                                                   uint8_t value_type,
                                                   uint16_t maxlen,
                                                   size_t value_len,
                                                   const uint8_t* value,
                                                   uint16_t *characteristic) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_add_uuid16_characteristic.session=session;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.service=service;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.property=property;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.security=security;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.flag=flag;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.uuid=uuid;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.value_type=value_type;
    cmd->data.cmd_gattdb_add_uuid16_characteristic.maxlen=maxlen;
    if ((16+value_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_gattdb_add_uuid16_characteristic.value.len=value_len;
    memcpy(cmd->data.cmd_gattdb_add_uuid16_characteristic.value.data,value,value_len);

    cmd->header=sl_bt_cmd_gattdb_add_uuid16_characteristic_id+(((16+value_len)&0xff)<<8)+(((16+value_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (characteristic) {
        *characteristic = rsp->data.rsp_gattdb_add_uuid16_characteristic.characteristic;
    }
    return rsp->data.rsp_gattdb_add_uuid16_characteristic.result;

}

sl_status_t sl_bt_gattdb_add_uuid128_characteristic(uint16_t session,
                                                    uint16_t service,
                                                    uint16_t property,
                                                    uint16_t security,
                                                    uint8_t flag,
                                                    uuid_128 uuid,
                                                    uint8_t value_type,
                                                    uint16_t maxlen,
                                                    size_t value_len,
                                                    const uint8_t* value,
                                                    uint16_t *characteristic) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_add_uuid128_characteristic.session=session;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.service=service;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.property=property;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.security=security;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.flag=flag;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.uuid=uuid;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.value_type=value_type;
    cmd->data.cmd_gattdb_add_uuid128_characteristic.maxlen=maxlen;
    if ((30+value_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_gattdb_add_uuid128_characteristic.value.len=value_len;
    memcpy(cmd->data.cmd_gattdb_add_uuid128_characteristic.value.data,value,value_len);

    cmd->header=sl_bt_cmd_gattdb_add_uuid128_characteristic_id+(((30+value_len)&0xff)<<8)+(((30+value_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (characteristic) {
        *characteristic = rsp->data.rsp_gattdb_add_uuid128_characteristic.characteristic;
    }
    return rsp->data.rsp_gattdb_add_uuid128_characteristic.result;

}

sl_status_t sl_bt_gattdb_remove_characteristic(uint16_t session,
                                               uint16_t characteristic) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_remove_characteristic.session=session;
    cmd->data.cmd_gattdb_remove_characteristic.characteristic=characteristic;

    cmd->header=sl_bt_cmd_gattdb_remove_characteristic_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_remove_characteristic.result;

