SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_gattdb_add_uuid16_descriptor(uint16_t session,
                                               uint16_t characteristic,
                                               uint16_t property,
                                               uint16_t security,
                                               sl_bt_uuid_16_t uuid,
                                               uint8_t value_type,
                                               uint16_t maxlen,
                                               size_t value_len,
                                               const uint8_t* value,
                                               uint16_t *descriptor) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_add_uuid16_descriptor.session=session;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.characteristic=characteristic;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.property=property;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.security=security;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.uuid=uuid;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.value_type=value_type;
    cmd->data.cmd_gattdb_add_uuid16_descriptor.maxlen=maxlen;
    if ((15+value_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_gattdb_add_uuid16_descriptor.value.len=value_len;
    memcpy(cmd->data.cmd_gattdb_add_uuid16_descriptor.value.data,value,value_len);

    cmd->header=sl_bt_cmd_gattdb_add_uuid16_descriptor_id+(((15+value_len)&0xff)<<8)+(((15+value_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (descriptor) {
        *descriptor = rsp->data.rsp_gattdb_add_uuid16_descriptor.descriptor;
    }
    return rsp->data.rsp_gattdb_add_uuid16_descriptor.result;

}

sl_status_t sl_bt_gattdb_add_uuid128_descriptor(uint16_t session,
                                                uint16_t characteristic,
                                                uint16_t property,
                                                uint16_t security,
                                                uuid_128 uuid,
                                                uint8_t value_type,
                                                uint16_t maxlen,
                                                size_t value_len,
                                                const uint8_t* value,
                                                uint16_t *descriptor) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_add_uuid128_descriptor.session=session;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.characteristic=characteristic;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.property=property;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.security=security;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.uuid=uuid;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.value_type=value_type;
    cmd->data.cmd_gattdb_add_uuid128_descriptor.maxlen=maxlen;
    if ((29+value_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_gattdb_add_uuid128_descriptor.value.len=value_len;
    memcpy(cmd->data.cmd_gattdb_add_uuid128_descriptor.value.data,value,value_len);

    cmd->header=sl_bt_cmd_gattdb_add_uuid128_descriptor_id+(((29+value_len)&0xff)<<8)+(((29+value_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (descriptor) {
        *descriptor = rsp->data.rsp_gattdb_add_uuid128_descriptor.descriptor;
    }
    return rsp->data.rsp_gattdb_add_uuid128_descriptor.result;

}

sl_status_t sl_bt_gattdb_remove_descriptor(uint16_t session,
                                           uint16_t descriptor) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_remove_descriptor.session=session;
    cmd->data.cmd_gattdb_remove_descriptor.descriptor=descriptor;

    cmd->header=sl_bt_cmd_gattdb_remove_descriptor_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_remove_descriptor.result;

}

sl_status_t sl_bt_gattdb_start_service(uint16_t session, uint16_t service) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_start_service.session=session;
    cmd->data.cmd_gattdb_start_service.service=service;

    cmd->header=sl_bt_cmd_gattdb_start_service_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_start_service.result;

}

sl_status_t sl_bt_gattdb_stop_service(uint16_t session, uint16_t service) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_stop_service.session=session;
    cmd->data.cmd_gattdb_stop_service.service=service;

    cmd->header=sl_bt_cmd_gattdb_stop_service_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_stop_service.result;

}

sl_status_t sl_bt_gattdb_start_characteristic(uint16_t session,
                                              uint16_t characteristic) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_gattdb_start_characteristic.session=session;
    cmd->data.cmd_gattdb_start_characteristic.characteristic=characteristic;

    cmd->header=sl_bt_cmd_gattdb_start_characteristic_id+(((4)&0xff)<<8)+(((4)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_gattdb_start_characteristic.result;

}

sl_status_t sl_bt_gattdb_stop_characteristic(uint16_t session,
                                             uint16_t characteristic) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

