SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_coex_set_directional_priority_pulse(uint8_t pulse) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_coex_set_directional_priority_pulse.pulse=pulse;

    cmd->header=sl_bt_cmd_coex_set_directional_priority_pulse_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_coex_set_directional_priority_pulse.result;

}

sl_status_t sl_bt_coex_get_parameters(uint8_t *priority,
                                      uint8_t *request,
                                      uint8_t *pwm_period,
                                      uint8_t *pwm_dutycycle) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;


    cmd->header=sl_bt_cmd_coex_get_parameters_id+(((0)&0xff)<<8)+(((0)&0x700)>>8);


    sl_bt_host_handle_command();
    if (priority) {
        *priority = rsp->data.rsp_coex_get_parameters.priority;
    }
    if (request) {
        *request = rsp->data.rsp_coex_get_parameters.request;
    }
    if (pwm_period) {
        *pwm_period = rsp->data.rsp_coex_get_parameters.pwm_period;
    }
    if (pwm_dutycycle) {
        *pwm_dutycycle = rsp->data.rsp_coex_get_parameters.pwm_dutycycle;
    }
    return rsp->data.rsp_coex_get_parameters.result;

}

sl_status_t sl_bt_coex_get_counters(uint8_t reset,
                                    size_t max_counters_size,
                                    size_t *counters_len,
                                    uint8_t *counters) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_coex_get_counters.reset=reset;

    cmd->header=sl_bt_cmd_coex_get_counters_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    if (counters_len) {
        *counters_len = rsp->data.rsp_coex_get_counters.counters.len;
    }
    if (counters && (rsp->data.rsp_coex_get_counters.counters.len <= max_counters_size)) {
        memcpy(counters,rsp->data.rsp_coex_get_counters.counters.data,rsp->data.rsp_coex_get_counters.counters.len);
    }
    return rsp->data.rsp_coex_get_counters.result;

}

sl_status_t sl_bt_cs_security_enable(uint8_t connection) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_security_enable.connection=connection;

    cmd->header=sl_bt_cmd_cs_security_enable_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_security_enable.result;

}

sl_status_t sl_bt_cs_set_default_settings(uint8_t connection,
                                          uint8_t initiator_status,
                                          uint8_t reflector_status,
                                          uint8_t antenna_identifier,
                                          int8_t max_tx_power) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_set_default_settings.connection=connection;
    cmd->data.cmd_cs_set_default_settings.initiator_status=initiator_status;
    cmd->data.cmd_cs_set_default_settings.reflector_status=reflector_status;
    cmd->data.cmd_cs_set_default_settings.antenna_identifier=antenna_identifier;
    cmd->data.cmd_cs_set_default_settings.max_tx_power=max_tx_power;

    cmd->header=sl_bt_cmd_cs_set_default_settings_id+(((5)&0xff)<<8)+(((5)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_set_default_settings.result;

}

sl_status_t sl_bt_cs_create_config(uint8_t connection,
                                   uint8_t config_id,
                                   uint8_t create_context,
                                   uint8_t main_mode_type,
                                   uint8_t sub_mode_type,
                                   uint8_t min_main_mode_steps,
                                   uint8_t max_main_mode_steps,
                                   uint8_t main_mode_repetition,
                                   uint8_t mode_calibration_steps,
                                   uint8_t role,
                                   uint8_t rtt_type,
                                   uint8_t cs_sync_phy,
                                   const sl_bt_cs_channel_map_t *channel_map,
                                   uint8_t channel_map_repetition,
                                   uint8_t channel_selection_type,
                                   uint8_t ch3c_shape,
                                   uint8_t ch3c_jump,
                                   uint8_t reserved) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_create_config.connection=connection;
    cmd->data.cmd_cs_create_config.config_id=config_id;
    cmd->data.cmd_cs_create_config.create_context=create_context;
    cmd->data.cmd_cs_create_config.main_mode_type=main_mode_type;
    cmd->data.cmd_cs_create_config.sub_mode_type=sub_mode_type;
    cmd->data.cmd_cs_create_config.min_main_mode_steps=min_main_mode_steps;
    cmd->data.cmd_cs_create_config.max_main_mode_steps=max_main_mode_steps;
    cmd->data.cmd_cs_create_config.main_mode_repetition=main_mode_repetition;
    cmd->data.cmd_cs_create_config.mode_calibration_steps=mode_calibration_steps;
    cmd->data.cmd_cs_create_config.role=role;
    cmd->data.cmd_cs_create_config.rtt_type=rtt_type;
    cmd->data.cmd_cs_create_config.cs_sync_phy=cs_sync_phy;
    memcpy(&cmd->data.cmd_cs_create_config.channel_map,channel_map,sizeof(sl_bt_cs_channel_map_t));
    cmd->data.cmd_cs_create_config.channel_map_repetition=channel_map_repetition;
    cmd->data.cmd_cs_create_config.channel_selection_type=channel_selection_type;
    cmd->data.cmd_cs_create_config.ch3c_shape=ch3c_shape;
    cmd->data.cmd_cs_create_config.ch3c_jump=ch3c_jump;
    cmd->data.cmd_cs_create_config.reserved=reserved;

    cmd->header=sl_bt_cmd_cs_create_config_id+(((27)&0xff)<<8)+(((27)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_create_config.result;

