SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_cs_remove_config(uint8_t connection, uint8_t config_id) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_remove_config.connection=connection;
    cmd->data.cmd_cs_remove_config.config_id=config_id;

    cmd->header=sl_bt_cmd_cs_remove_config_id+(((2)&0xff)<<8)+(((2)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_remove_config.result;

}

sl_status_t sl_bt_cs_set_channel_classification(const sl_bt_cs_channel_map_t *channel_map) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    memcpy(&cmd->data.cmd_cs_set_channel_classification.channel_map,channel_map,sizeof(sl_bt_cs_channel_map_t));

    cmd->header=sl_bt_cmd_cs_set_channel_classification_id+(((10)&0xff)<<8)+(((10)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_set_channel_classification.result;

}

sl_status_t sl_bt_cs_set_procedure_parameters(uint8_t connection,
                                              uint8_t config_id,
                                              uint16_t max_procedure_len,
                                              uint16_t min_procedure_interval,
                                              uint16_t max_procedure_interval,
                                              uint16_t max_procedure_count,
                                              uint32_t min_subevent_len,
                                              uint32_t max_subevent_len,
                                              uint8_t tone_antenna_config_selection,
                                              uint8_t phy,
                                              int8_t tx_pwr_delta,
                                              uint8_t preferred_peer_antenna,
                                              uint8_t snr_control_initiator,
                                              uint8_t snr_control_reflector) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_set_procedure_parameters.connection=connection;
    cmd->data.cmd_cs_set_procedure_parameters.config_id=config_id;
    cmd->data.cmd_cs_set_procedure_parameters.max_procedure_len=max_procedure_len;
    cmd->data.cmd_cs_set_procedure_parameters.min_procedure_interval=min_procedure_interval;
    cmd->data.cmd_cs_set_procedure_parameters.max_procedure_interval=max_procedure_interval;
    cmd->data.cmd_cs_set_procedure_parameters.max_procedure_count=max_procedure_count;
    cmd->data.cmd_cs_set_procedure_parameters.min_subevent_len=min_subevent_len;
    cmd->data.cmd_cs_set_procedure_parameters.max_subevent_len=max_subevent_len;
    cmd->data.cmd_cs_set_procedure_parameters.tone_antenna_config_selection=tone_antenna_config_selection;
    cmd->data.cmd_cs_set_procedure_parameters.phy=phy;
    cmd->data.cmd_cs_set_procedure_parameters.tx_pwr_delta=tx_pwr_delta;
    cmd->data.cmd_cs_set_procedure_parameters.preferred_peer_antenna=preferred_peer_antenna;
    cmd->data.cmd_cs_set_procedure_parameters.snr_control_initiator=snr_control_initiator;
    cmd->data.cmd_cs_set_procedure_parameters.snr_control_reflector=snr_control_reflector;

    cmd->header=sl_bt_cmd_cs_set_procedure_parameters_id+(((24)&0xff)<<8)+(((24)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_set_procedure_parameters.result;

}

sl_status_t sl_bt_cs_procedure_enable(uint8_t connection,
                                      uint8_t enable,
                                      uint8_t config_id) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_procedure_enable.connection=connection;
    cmd->data.cmd_cs_procedure_enable.enable=enable;
    cmd->data.cmd_cs_procedure_enable.config_id=config_id;

    cmd->header=sl_bt_cmd_cs_procedure_enable_id+(((3)&0xff)<<8)+(((3)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_procedure_enable.result;

}

sl_status_t sl_bt_cs_set_antenna_configuration(size_t antenna_element_offset_len,
                                               const uint8_t* antenna_element_offset) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    if ((1+antenna_element_offset_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_cs_set_antenna_configuration.antenna_element_offset.len=antenna_element_offset_len;
    memcpy(cmd->data.cmd_cs_set_antenna_configuration.antenna_element_offset.data,antenna_element_offset,antenna_element_offset_len);

    cmd->header=sl_bt_cmd_cs_set_antenna_configuration_id+(((1+antenna_element_offset_len)&0xff)<<8)+(((1+antenna_element_offset_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_set_antenna_configuration.result;

}

sl_status_t sl_bt_cs_read_local_supported_capabilities(uint8_t *num_config,
                                                       uint16_t *max_consecutive_procedures,
                                                       uint8_t *num_antennas,
                                                       uint8_t *max_antenna_paths,
                                                       uint8_t *roles,
                                                       uint8_t *modes,
                                                       uint8_t *rtt_capability,
                                                       uint8_t *rtt_aa_only,
                                                       uint8_t *rtt_sounding,
                                                       uint8_t *rtt_random_payload,
                                                       uint8_t *cs_sync_phys,
                                                       uint16_t *subfeatures,
                                                       uint16_t *t_ip1_times,
                                                       uint16_t *t_ip2_times,
                                                       uint16_t *t_fcs_times,
                                                       uint16_t *t_pm_times,
                                                       uint8_t *t_sw_times,
                                                       uint8_t *tx_snr_capability) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;


    cmd->header=sl_bt_cmd_cs_read_local_supported_capabilities_id+(((0)&0xff)<<8)+(((0)&0x700)>>8);


    sl_bt_host_handle_command();
    if (num_config) {
        *num_config = rsp->data.rsp_cs_read_local_supported_capabilities.num_config;
    }
    if (max_consecutive_procedures) {
        *max_consecutive_procedures = rsp->data.rsp_cs_read_local_supported_capabilities.max_consecutive_procedures;
    }
    if (num_antennas) {
        *num_antennas = rsp->data.rsp_cs_read_local_supported_capabilities.num_antennas;
    }
    if (max_antenna_paths) {
        *max_antenna_paths = rsp->data.rsp_cs_read_local_supported_capabilities.max_antenna_paths;
    }
    if (roles) {
        *roles = rsp->data.rsp_cs_read_local_supported_capabilities.roles;
    }
    if (modes) {
        *modes = rsp->data.rsp_cs_read_local_supported_capabilities.modes;
    }
    if (rtt_capability) {
        *rtt_capability = rsp->data.rsp_cs_read_local_supported_capabilities.rtt_capability;
    }
    if (rtt_aa_only) {
        *rtt_aa_only = rsp->data.rsp_cs_read_local_supported_capabilities.rtt_aa_only;
    }
    if (rtt_sounding) {
        *rtt_sounding = rsp->data.rsp_cs_read_local_supported_capabilities.rtt_sounding;
    }
    if (rtt_random_payload) {
        *rtt_random_payload = rsp->data.rsp_cs_read_local_supported_capabilities.rtt_random_payload;
    }
    if (cs_sync_phys) {
        *cs_sync_phys = rsp->data.rsp_cs_read_local_supported_capabilities.cs_sync_phys;
    }
    if (subfeatures) {
        *subfeatures = rsp->data.rsp_cs_read_local_supported_capabilities.subfeatures;
    }
    if (t_ip1_times) {
        *t_ip1_times = rsp->data.rsp_cs_read_local_supported_capabilities.t_ip1_times;
    }
    if (t_ip2_times) {
        *t_ip2_times = rsp->data.rsp_cs_read_local_supported_capabilities.t_ip2_times;
    }
    if (t_fcs_times) {
        *t_fcs_times = rsp->data.rsp_cs_read_local_supported_capabilities.t_fcs_times;
    }
    if (t_pm_times) {
        *t_pm_times = rsp->data.rsp_cs_read_local_supported_capabilities.t_pm_times;
    }
    if (t_sw_times) {
        *t_sw_times = rsp->data.rsp_cs_read_local_supported_capabilities.t_sw_times;
    }
    if (tx_snr_capability) {
        *tx_snr_capability = rsp->data.rsp_cs_read_local_supported_capabilities.tx_snr_capability;
    }
    return rsp->data.rsp_cs_read_local_supported_capabilities.result;

