SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_cs_read_remote_supported_capabilities(uint8_t connection) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_read_remote_supported_capabilities.connection=connection;

    cmd->header=sl_bt_cmd_cs_read_remote_supported_capabilities_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_read_remote_supported_capabilities.result;

}

sl_status_t sl_bt_cs_test_start(uint8_t main_mode_type,
                                uint8_t sub_mode_type,
                                uint8_t main_mode_repetition,
                                uint8_t mode_calibration_steps,
                                uint8_t role,
                                uint8_t rtt_type,
                                uint8_t cs_sync_phy,
                                uint8_t antenna_selection,
                                const sl_bt_cs_subevent_length_t *subevent_len,
                                uint16_t subevent_interval,
                                uint8_t max_num_subevents,
                                int8_t tx_power,
                                uint8_t t_ip1_time,
                                uint8_t t_ip2_time,
                                uint8_t t_fcs_time,
                                uint8_t t_pm_time,
                                uint8_t t_sw_time,
                                uint8_t tone_antenna_config,
                                uint8_t reserved,
                                uint8_t snr_control_initiator,
                                uint8_t snr_control_reflector,
                                uint16_t drbg_nonce,
                                uint8_t channel_map_repetition,
                                uint16_t override_config,
                                size_t override_parameters_len,
                                const uint8_t* override_parameters) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_cs_test_start.main_mode_type=main_mode_type;
    cmd->data.cmd_cs_test_start.sub_mode_type=sub_mode_type;
    cmd->data.cmd_cs_test_start.main_mode_repetition=main_mode_repetition;
    cmd->data.cmd_cs_test_start.mode_calibration_steps=mode_calibration_steps;
    cmd->data.cmd_cs_test_start.role=role;
    cmd->data.cmd_cs_test_start.rtt_type=rtt_type;
    cmd->data.cmd_cs_test_start.cs_sync_phy=cs_sync_phy;
    cmd->data.cmd_cs_test_start.antenna_selection=antenna_selection;
    memcpy(&cmd->data.cmd_cs_test_start.subevent_len,subevent_len,sizeof(sl_bt_cs_subevent_length_t));
    cmd->data.cmd_cs_test_start.subevent_interval=subevent_interval;
    cmd->data.cmd_cs_test_start.max_num_subevents=max_num_subevents;
    cmd->data.cmd_cs_test_start.tx_power=tx_power;
    cmd->data.cmd_cs_test_start.t_ip1_time=t_ip1_time;
    cmd->data.cmd_cs_test_start.t_ip2_time=t_ip2_time;
    cmd->data.cmd_cs_test_start.t_fcs_time=t_fcs_time;
    cmd->data.cmd_cs_test_start.t_pm_time=t_pm_time;
    cmd->data.cmd_cs_test_start.t_sw_time=t_sw_time;
    cmd->data.cmd_cs_test_start.tone_antenna_config=tone_antenna_config;
    cmd->data.cmd_cs_test_start.reserved=reserved;
    cmd->data.cmd_cs_test_start.snr_control_initiator=snr_control_initiator;
    cmd->data.cmd_cs_test_start.snr_control_reflector=snr_control_reflector;
    cmd->data.cmd_cs_test_start.drbg_nonce=drbg_nonce;
    cmd->data.cmd_cs_test_start.channel_map_repetition=channel_map_repetition;
    cmd->data.cmd_cs_test_start.override_config=override_config;
    if ((30+override_parameters_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_cs_test_start.override_parameters.len=override_parameters_len;
    memcpy(cmd->data.cmd_cs_test_start.override_parameters.data,override_parameters,override_parameters_len);

    cmd->header=sl_bt_cmd_cs_test_start_id+(((30+override_parameters_len)&0xff)<<8)+(((30+override_parameters_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_test_start.result;

}

sl_status_t sl_bt_cs_test_end() {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;


    cmd->header=sl_bt_cmd_cs_test_end_id+(((0)&0xff)<<8)+(((0)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_cs_test_end.result;

}

sl_status_t sl_bt_l2cap_open_le_channel(uint8_t connection,
                                        uint16_t spsm,
                                        uint16_t max_sdu,
                                        uint16_t max_pdu,
                                        uint16_t credit,
                                        uint16_t *cid) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_l2cap_open_le_channel.connection=connection;
    cmd->data.cmd_l2cap_open_le_channel.spsm=spsm;
    cmd->data.cmd_l2cap_open_le_channel.max_sdu=max_sdu;
    cmd->data.cmd_l2cap_open_le_channel.max_pdu=max_pdu;
    cmd->data.cmd_l2cap_open_le_channel.credit=credit;

    cmd->header=sl_bt_cmd_l2cap_open_le_channel_id+(((9)&0xff)<<8)+(((9)&0x700)>>8);


    sl_bt_host_handle_command();
    if (cid) {
        *cid = rsp->data.rsp_l2cap_open_le_channel.cid;
    }
    return rsp->data.rsp_l2cap_open_le_channel.result;

}

sl_status_t sl_bt_l2cap_send_le_channel_open_response(uint8_t connection,
                                                      uint16_t cid,
                                                      uint16_t max_sdu,
                                                      uint16_t max_pdu,
                                                      uint16_t credit,
                                                      uint16_t errorcode) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_l2cap_send_le_channel_open_response.connection=connection;
    cmd->data.cmd_l2cap_send_le_channel_open_response.cid=cid;
    cmd->data.cmd_l2cap_send_le_channel_open_response.max_sdu=max_sdu;
    cmd->data.cmd_l2cap_send_le_channel_open_response.max_pdu=max_pdu;
    cmd->data.cmd_l2cap_send_le_channel_open_response.credit=credit;
    cmd->data.cmd_l2cap_send_le_channel_open_response.errorcode=errorcode;

