SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sl_bt_ncp_host_api.c
}

sl_status_t sl_bt_connection_analyzer_start(uint32_t access_address,
                                            uint32_t crc_init,
                                            uint16_t interval,
                                            uint16_t supervision_timeout,
                                            uint8_t central_clock_accuracy,
                                            uint8_t central_phy,
                                            uint8_t peripheral_phy,
                                            uint8_t channel_selection_algorithm,
                                            uint8_t hop,
                                            const sl_bt_connection_channel_map_t *channel_map,
                                            uint8_t channel,
                                            uint16_t event_counter,
                                            int32_t start_time_us,
                                            uint32_t flags,
                                            uint8_t *analyzer) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_analyzer_start.access_address=access_address;
    cmd->data.cmd_connection_analyzer_start.crc_init=crc_init;
    cmd->data.cmd_connection_analyzer_start.interval=interval;
    cmd->data.cmd_connection_analyzer_start.supervision_timeout=supervision_timeout;
    cmd->data.cmd_connection_analyzer_start.central_clock_accuracy=central_clock_accuracy;
    cmd->data.cmd_connection_analyzer_start.central_phy=central_phy;
    cmd->data.cmd_connection_analyzer_start.peripheral_phy=peripheral_phy;
    cmd->data.cmd_connection_analyzer_start.channel_selection_algorithm=channel_selection_algorithm;
    cmd->data.cmd_connection_analyzer_start.hop=hop;
    memcpy(&cmd->data.cmd_connection_analyzer_start.channel_map,channel_map,sizeof(sl_bt_connection_channel_map_t));
    cmd->data.cmd_connection_analyzer_start.channel=channel;
    cmd->data.cmd_connection_analyzer_start.event_counter=event_counter;
    cmd->data.cmd_connection_analyzer_start.start_time_us=start_time_us;
    cmd->data.cmd_connection_analyzer_start.flags=flags;

    cmd->header=sl_bt_cmd_connection_analyzer_start_id+(((33)&0xff)<<8)+(((33)&0x700)>>8);


    sl_bt_host_handle_command();
    if (analyzer) {
        *analyzer = rsp->data.rsp_connection_analyzer_start.analyzer;
    }
    return rsp->data.rsp_connection_analyzer_start.result;

}

sl_status_t sl_bt_connection_analyzer_stop(uint8_t analyzer) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    cmd->data.cmd_connection_analyzer_stop.analyzer=analyzer;

    cmd->header=sl_bt_cmd_connection_analyzer_stop_id+(((1)&0xff)<<8)+(((1)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_connection_analyzer_stop.result;

}

sl_status_t sl_bt_user_message_to_target(size_t data_len,
                                         const uint8_t* data,
                                         size_t max_response_size,
                                         size_t *response_len,
                                         uint8_t *response) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    if ((1+data_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_user_message_to_target.data.len=data_len;
    memcpy(cmd->data.cmd_user_message_to_target.data.data,data,data_len);

    cmd->header=sl_bt_cmd_user_message_to_target_id+(((1+data_len)&0xff)<<8)+(((1+data_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (response_len) {
        *response_len = rsp->data.rsp_user_message_to_target.response.len;
    }
    if (response && (rsp->data.rsp_user_message_to_target.response.len <= max_response_size)) {
        memcpy(response,rsp->data.rsp_user_message_to_target.response.data,rsp->data.rsp_user_message_to_target.response.len);
    }
    return rsp->data.rsp_user_message_to_target.result;

}

sl_status_t sl_bt_user_manage_event_filter(size_t data_len,
                                           const uint8_t* data) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    if ((1+data_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_user_manage_event_filter.data.len=data_len;
    memcpy(cmd->data.cmd_user_manage_event_filter.data.data,data,data_len);

    cmd->header=sl_bt_cmd_user_manage_event_filter_id+(((1+data_len)&0xff)<<8)+(((1+data_len)&0x700)>>8);


    sl_bt_host_handle_command();
    return rsp->data.rsp_user_manage_event_filter.result;

}

void sl_bt_user_reset_to_dfu() {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;


    cmd->header=sl_bt_cmd_user_reset_to_dfu_id+(((0)&0xff)<<8)+(((0)&0x700)>>8);


    sl_bt_host_handle_command_noresponse();
}

sl_status_t sl_bt_user_cs_service_message_to_target(size_t data_len,
                                                    const uint8_t* data,
                                                    size_t max_response_size,
                                                    size_t *response_len,
                                                    uint8_t *response) {
    struct sl_bt_packet *cmd = (struct sl_bt_packet *)sl_bt_cmd_msg;

    struct sl_bt_packet *rsp = (struct sl_bt_packet *)sl_bt_rsp_msg;

    if ((1+data_len) > SL_BGAPI_MAX_PAYLOAD_SIZE )
    {
        return SL_STATUS_COMMAND_TOO_LONG;
    }
    cmd->data.cmd_user_cs_service_message_to_target.data.len=data_len;
    memcpy(cmd->data.cmd_user_cs_service_message_to_target.data.data,data,data_len);

    cmd->header=sl_bt_cmd_user_cs_service_message_to_target_id+(((1+data_len)&0xff)<<8)+(((1+data_len)&0x700)>>8);


    sl_bt_host_handle_command();
    if (response_len) {
        *response_len = rsp->data.rsp_user_cs_service_message_to_target.response.len;
    }
    if (response && (rsp->data.rsp_user_cs_service_message_to_target.response.len <= max_response_size)) {
        memcpy(response,rsp->data.rsp_user_cs_service_message_to_target.response.data,rsp->data.rsp_user_cs_service_message_to_target.response.len);
    }
    return rsp->data.rsp_user_cs_service_message_to_target.result;

}
